clc 
clear 
f1=[30 
32
31
60
62
59
59
65
34
35];
f2=[119
120
120
52
50
53
54
50
100
97
];
f3=[0
0
0
100
100
100
100
100
0
0
];

%Задача 2
f1=(f1 - min(f1) )./( max(f1)-min(f1) );
f2=(f2 - min(f2) )./( max(f2)-min(f2) );
f3=(f3- min(f3) )./( max(f3)-min(f3) );

F = [ f1 f2 f3 ] 

%Задача 3
%отбрасываем по Парето 2 строку, 3 ,  7 строку , 8 
F1 = [F(1,:) ; F(4:6,:) ; F(9:10,:) ]  
 
plot3 ( F(:,1) , F(:,2) , F(:,3) , 'r.' ,F1(:,1) , F1(:,2) , F1(:,3) , 'g.' ) ;   grid on
%Задача 4
r2=F1(:,1).^2+F1(:,2).^2+F1(:,3).^2  ;
[min , I]  = min(r2) ;
%оптимум 10 вариант .
%Задача 5
F2 = 0.3.*F1(:,1)+0.6.*F1(:,2)+0.1.*F1(:,3) 
%оптимум 4.5. 6 вариант .